dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxSpu_bf.h
/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CAGUARD */
#define IFX_SPU_CFAR_CFG1_CAGUARD_LEN (6u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CAGUARD */
#define IFX_SPU_CFAR_CFG1_CAGUARD_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CAGUARD */
#define IFX_SPU_CFAR_CFG1_CAGUARD_OFF (4u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CAWINCELL */
#define IFX_SPU_CFAR_CFG1_CAWINCELL_LEN (3u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CAWINCELL */
#define IFX_SPU_CFAR_CFG1_CAWINCELL_MSK (0x7u)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CAWINCELL */
#define IFX_SPU_CFAR_CFG1_CAWINCELL_OFF (10u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CFARSEL */
#define IFX_SPU_CFAR_CFG1_CFARSEL_LEN (2u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CFARSEL */
#define IFX_SPU_CFAR_CFG1_CFARSEL_MSK (0x3u)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CFARSEL */
#define IFX_SPU_CFAR_CFG1_CFARSEL_OFF (14u)

/** \brief Length for Ifx_SPU_CFAR_CFG1_Bits.CABETA */
#define IFX_SPU_CFAR_CFG1_CABETA_LEN (16u)

/** \brief Mask for Ifx_SPU_CFAR_CFG1_Bits.CABETA */
#define IFX_SPU_CFAR_CFG1_CABETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFAR_CFG1_Bits.CABETA */
#define IFX_SPU_CFAR_CFG1_CABETA_OFF (16u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.GOSGUARD */
#define IFX_SPU_CFAR_CFG2_GOSGUARD_LEN (6u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.GOSGUARD */
#define IFX_SPU_CFAR_CFG2_GOSGUARD_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.GOSGUARD */
#define IFX_SPU_CFAR_CFG2_GOSGUARD_OFF (0u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.IDXLD */
#define IFX_SPU_CFAR_CFG2_IDXLD_LEN (5u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.IDXLD */
#define IFX_SPU_CFAR_CFG2_IDXLD_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.IDXLD */
#define IFX_SPU_CFAR_CFG2_IDXLD_OFF (6u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.IDXLG */
#define IFX_SPU_CFAR_CFG2_IDXLG_LEN (5u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.IDXLG */
#define IFX_SPU_CFAR_CFG2_IDXLG_MSK (0x1fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.IDXLG */
#define IFX_SPU_CFAR_CFG2_IDXLG_OFF (11u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFAR_CFG2_GOSWINCELL_LEN (6u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFAR_CFG2_GOSWINCELL_MSK (0x3fu)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.GOSWINCELL */
#define IFX_SPU_CFAR_CFG2_GOSWINCELL_OFF (16u)

/** \brief Length for Ifx_SPU_CFAR_CFG2_Bits.CASHWIN */
#define IFX_SPU_CFAR_CFG2_CASHWIN_LEN (3u)

/** \brief Mask for Ifx_SPU_CFAR_CFG2_Bits.CASHWIN */
#define IFX_SPU_CFAR_CFG2_CASHWIN_MSK (0x7u)

/** \brief Offset for Ifx_SPU_CFAR_CFG2_Bits.CASHWIN */
#define IFX_SPU_CFAR_CFG2_CASHWIN_OFF (22u)

/** \brief Length for Ifx_SPU_CFAR_CFG3_Bits.GOSBETA */
#define IFX_SPU_CFAR_CFG3_GOSBETA_LEN (16u)

/** \brief Mask for Ifx_SPU_CFAR_CFG3_Bits.GOSBETA */
#define IFX_SPU_CFAR_CFG3_GOSBETA_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFAR_CFG3_Bits.GOSBETA */
#define IFX_SPU_CFAR_CFG3_GOSBETA_OFF (0u)

/** \brief Length for Ifx_SPU_CFAR_CFG3_Bits.CHAN5OFFST */
#define IFX_SPU_CFAR_CFG3_CHAN5OFFST_LEN (16u)

/** \brief Mask for Ifx_SPU_CFAR_CFG3_Bits.CHAN5OFFST */
#define IFX_SPU_CFAR_CFG3_CHAN5OFFST_MSK (0xffffu)

/** \brief Offset for Ifx_SPU_CFAR_CFG3_Bits.CHAN5OFFST */
#define IFX_SPU_CFAR_CFG3_CHAN5OFFST_OFF (16u)

/** \brief Length for Ifx_SPU_SCALARADD_Bits.OPERAND */
#define IFX_SPU_SCALARADD_OPERAND_LEN (32u)

/** \brief Mask for Ifx_SPU_SCALARADD_Bits.OPERAND */
#define IFX_SPU_SCALARADD_OPERAND_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_SCALARADD_Bits.OPERAND */
#define IFX_SPU_SCALARADD_OPERAND_OFF (0u)

/** \brief Length for Ifx_SPU_SCALARMULT_Bits.OPERAND */
#define IFX_SPU_SCALARMULT_OPERAND_LEN (32u)

/** \brief Mask for Ifx_SPU_SCALARMULT_Bits.OPERAND */
#define IFX_SPU_SCALARMULT_OPERAND_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_SCALARMULT_Bits.OPERAND */
#define IFX_SPU_SCALARMULT_OPERAND_OFF (0u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.RMODE */
#define IFX_SPU_BINREJCTRL_RMODE_LEN (2u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.RMODE */
#define IFX_SPU_BINREJCTRL_RMODE_MSK (0x3u)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.RMODE */
#define IFX_SPU_BINREJCTRL_RMODE_OFF (0u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.ZMODE */
#define IFX_SPU_BINREJCTRL_ZMODE_LEN (1u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.ZMODE */
#define IFX_SPU_BINREJCTRL_ZMODE_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.ZMODE */
#define IFX_SPU_BINREJCTRL_ZMODE_OFF (2u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.LJUST */
#define IFX_SPU_BINREJCTRL_LJUST_LEN (1u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.LJUST */
#define IFX_SPU_BINREJCTRL_LJUST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.LJUST */
#define IFX_SPU_BINREJCTRL_LJUST_OFF (3u)

/** \brief Length for Ifx_SPU_BINREJCTRL_Bits.VALUE */
#define IFX_SPU_BINREJCTRL_VALUE_LEN (24u)

/** \brief Mask for Ifx_SPU_BINREJCTRL_Bits.VALUE */
#define IFX_SPU_BINREJCTRL_VALUE_MSK (0xffffffu)

/** \brief Offset for Ifx_SPU_BINREJCTRL_Bits.VALUE */
#define IFX_SPU_BINREJCTRL_VALUE_OFF (4u)

/** \brief Length for Ifx_SPU_LCLMAX_Bits.WIDTH */
#define IFX_SPU_LCLMAX_WIDTH_LEN (2u)

/** \brief Mask for Ifx_SPU_LCLMAX_Bits.WIDTH */
#define IFX_SPU_LCLMAX_WIDTH_MSK (0x3u)

/** \brief Offset for Ifx_SPU_LCLMAX_Bits.WIDTH */
#define IFX_SPU_LCLMAX_WIDTH_OFF (0u)

/** \brief Length for Ifx_SPU_LCLMAX_Bits.TMODE */
#define IFX_SPU_LCLMAX_TMODE_LEN (2u)

/** \brief Mask for Ifx_SPU_LCLMAX_Bits.TMODE */
#define IFX_SPU_LCLMAX_TMODE_MSK (0x3u)

/** \brief Offset for Ifx_SPU_LCLMAX_Bits.TMODE */
#define IFX_SPU_LCLMAX_TMODE_OFF (2u)

/** \brief Length for Ifx_SPU_LCLMAX_Bits.LMODE */
#define IFX_SPU_LCLMAX_LMODE_LEN (2u)

/** \brief Mask for Ifx_SPU_LCLMAX_Bits.LMODE */
#define IFX_SPU_LCLMAX_LMODE_MSK (0x3u)

/** \brief Offset for Ifx_SPU_LCLMAX_Bits.LMODE */
#define IFX_SPU_LCLMAX_LMODE_OFF (4u)

/** \brief Length for Ifx_SPU_LCLMAX_Bits.CMBN */
#define IFX_SPU_LCLMAX_CMBN_LEN (1u)

/** \brief Mask for Ifx_SPU_LCLMAX_Bits.CMBN */
#define IFX_SPU_LCLMAX_CMBN_MSK (0x1u)

/** \brief Offset for Ifx_SPU_LCLMAX_Bits.CMBN */
#define IFX_SPU_LCLMAX_CMBN_OFF (6u)

/** \brief Length for Ifx_SPU_LCLMAX_Bits.LJUST */
#define IFX_SPU_LCLMAX_LJUST_LEN (1u)

/** \brief Mask for Ifx_SPU_LCLMAX_Bits.LJUST */
#define IFX_SPU_LCLMAX_LJUST_MSK (0x1u)

/** \brief Offset for Ifx_SPU_LCLMAX_Bits.LJUST */
#define IFX_SPU_LCLMAX_LJUST_OFF (7u)

/** \brief Length for Ifx_SPU_LCLMAX_Bits.TSHLD */
#define IFX_SPU_LCLMAX_TSHLD_LEN (24u)

/** \brief Mask for Ifx_SPU_LCLMAX_Bits.TSHLD */
#define IFX_SPU_LCLMAX_TSHLD_MSK (0xffffffu)

/** \brief Offset for Ifx_SPU_LCLMAX_Bits.TSHLD */
#define IFX_SPU_LCLMAX_TSHLD_OFF (8u)

/** \brief Length for Ifx_SPU_REGCRC_Bits.CRC */
#define IFX_SPU_REGCRC_CRC_LEN (32u)

/** \brief Mask for Ifx_SPU_REGCRC_Bits.CRC */
#define IFX_SPU_REGCRC_CRC_MSK (0xffffffffu)

/** \brief Offset for Ifx_SPU_REGCRC_Bits.CRC */
#define IFX_SPU_REGCRC_CRC_OFF (0u)

/** \brief Length for Ifx_SPU_CTRL_Bits.TRIG */
#define IFX_SPU_CTRL_TRIG_LEN (1u)

/** \brief Mask for Ifx_SPU_CTRL_Bits.TRIG */
#define IFX_SPU_CTRL_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_SPU_CTRL_Bits.TRIG */
#define IFX_SPU_CTRL_TRIG_OFF (0u)

/** \brief Length for Ifx_SPU_CTRL_Bits.BUSY */
#define IFX_SPU_CTRL_BUSY_LEN (1u)

/** \brief Mask for Ifx_SPU_CTRL_Bits.BUSY */
#define IFX_SPU_CTRL_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_SPU_CTRL_Bits.BUSY */
#define IFX_SPU_CTRL_BUSY_OFF (1u)

/** \brief Length for Ifx_SPU_CTRL_Bits.MODE */
#define IFX_SPU_CTRL_MODE_LEN (3u)

/** \brief Mask for Ifx_SPU_CTRL_Bits.MODE */
#define IFX_SPU_CTRL_MODE_MSK (0x7u)

